# Merging

In [2]:
import numpy as np 
import pandas as pd

In [3]:
employee = pd.DataFrame({
    'Emp_id' : [1,2,3,4,5],
    'name' : ['john','jay','kartik','sanjay','yug'],
    'department' : ['HR','IT','Finance','IT','HR'],
})

salary = pd.DataFrame({
    'Emp_id' : [1,2,3,6,7],
    'salary' : [10000,30000,50000,30000,10000]
})

In [4]:
employee

   Emp_id    name department
0       1    john         HR
1       2     jay         IT
2       3  kartik    Finance
3       4  sanjay         IT
4       5     yug         HR

In [5]:
salary

   Emp_id  salary
0       1   10000
1       2   30000
2       3   50000
3       6   30000
4       7   10000

In [6]:
# only merge only of the same employee id's
pd.merge(employee,salary)

   Emp_id    name department  salary
0       1    john         HR   10000
1       2     jay         IT   30000
2       3  kartik    Finance   50000

In [7]:
pd.merge(employee,salary,on='Emp_id')

   Emp_id    name department  salary
0       1    john         HR   10000
1       2     jay         IT   30000
2       3  kartik    Finance   50000

# inner

In [8]:
pd.merge(employee,salary,on='Emp_id',how='inner')

   Emp_id    name department  salary
0       1    john         HR   10000
1       2     jay         IT   30000
2       3  kartik    Finance   50000

# outer

In [10]:
pd.merge(employee,salary,on='Emp_id',how='outer')

   Emp_id    name department   salary
0       1    john         HR  10000.0
1       2     jay         IT  30000.0
2       3  kartik    Finance  50000.0
3       4  sanjay         IT      NaN
4       5     yug         HR      NaN
5       6     NaN        NaN  30000.0
6       7     NaN        NaN  10000.0

# left

In [12]:
pd.merge(employee,salary,on='Emp_id',how='left')

   Emp_id    name department   salary
0       1    john         HR  10000.0
1       2     jay         IT  30000.0
2       3  kartik    Finance  50000.0
3       4  sanjay         IT      NaN
4       5     yug         HR      NaN

# right

In [13]:
pd.merge(employee,salary,on='Emp_id',how='right')

   Emp_id    name department  salary
0       1    john         HR   10000
1       2     jay         IT   30000
2       3  kartik    Finance   50000
3       6     NaN        NaN   30000
4       7     NaN        NaN   10000